
    
/*    


       ████████████████████████████████████████████████████
       ██               Md.Faruk Hossain                 ██
       ██    ███████╗ █████╗ ██████╗ ██╗   ██╗██╗  ██╗   ██
       ██    ██╔════╝██╔══██╗██╔══██╗██║   ██║██║ ██╔╝   ██
       ██    █████╗  ███████║██████╔╝██║   ██║█████╔╝    ██
       ██    ██╔══╝  ██╔══██║██╔══██╗██║   ██║██╔═██╗    ██
       ██    ██║     ██║  ██║██║  ██║╚██████╔╝██║  ██╗   ██
       ██    ╚═╝     ╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝ ╚═╝  ╚═╝   ██
       ████████████████████████████████████████████████████

*/


#include <bits/stdc++.h>
using namespace std;
 
#define nl "\n"
#define nf cout<<"\n"
#define int long long
#define cy cout << "YES\n"
#define cn cout << "NO\n"
#define fr(N)for(int i=0;i<N;i++)
#define frg(x,a) for(auto x:a)
#define vll vector<long long>
#define all(v) v.begin(),v.end()
#define rall(v) v.rbegin(),v.rend()

#define fastio ios_base::sync_with_stdio(0);cout.tie(nullptr);cin.tie(nullptr)

void solve(){
    int n,k;cin>>n>>k;
    vll a(n);fr(n)cin>>a[i];

    int p;cin>>p;
    p--;
    int x = a[p];

    int l=0, r=n-1;
    int cnt=0;
    int ii=a[p];
    for(int i=p;i<=r;i++){
        if(ii!=a[i]){
            ii=a[i];
            cnt++;
        }
    }
    if(a[p]!=a.back())cnt++;
    ii=a[p];
    int cnt1=0;
    for(int i=p;i>=0;i--){
        if(ii!=a[i]){
            ii=a[i];
            cnt1++;
        }
    }
    if(a[p]!=a[0])cnt1++;
    // cout<<cnt1<<nl;
    // cout<<cnt<<nl;
    cout<<max(cnt1,cnt)<<nl;
} 

int32_t main() {
    fastio;
    int t=1;cin>>t;
    while(t--)solve();
    return 0;
}